app/views/carts/show.html.erb

            <tbody>
              <% @cart.line_items.order({ created_at: :desc }).each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 ORDER BY "line_items"."created_at" DESC  [["cart_id", 6]]