app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
DELETE FROM "line_items" WHERE "line_items"."cart_id" = $1 AND (23)  [["cart_id", 17]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."id" = $2 LIMIT $3  [["cart_id", 10], ["id", 14], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items"
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT $2  [["cart_id", 11], ["LIMIT", 1]]
---
  def destroy
    @current_cart.line_items.find(params[:line_id]).destroy
    if @current_cart.line_items.empty?