app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @footer_variable = true
    @products = Product.all