app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "line_items" ON "products"."id" = "line_items"."product_id" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
SELECT 1 AS one FROM "products" INNER JOIN "line_items" ON "products"."id" = "line_items"."product_id" WHERE "line_items"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-05-05 05:37:10.234000"], ["updated_at", "2020-05-05 05:37:10.234000"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["cart_id", 1], ["created_at", "2020-05-05 00:36:17.376699"], ["updated_at", "2020-05-05 00:36:17.376699"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2020-05-05 00:36:50.812039"], ["id", 1]]
---
  def create
    # Find associated product and current cart
    chosen_product = Product.find(params[:product_id])
    current_cart = @current_cart

    # If cart already has this product then find the relevant line_item and iterate quantity otherwise create a new line_item for this product
    if current_cart.products.include?(chosen_product)
      # Find the line_item with the chosen_product
      @line_item = current_cart.line_items.find_by(:product_id => chosen_product)
      # Iterate the line_item's quantity by one
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.product = chosen_product
    end

    # Save and redirect to cart show path
    @line_item.save

UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 3], ["updated_at", "2020-05-05 00:43:31.747249"], ["id", 1]]
---
  def add_quantity
    @line_item.quantity += 1
    @line_item.save

UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 3], ["updated_at", "2020-05-05 00:43:55.773805"], ["id", 1]]
---
  def reduce_quantity
    if @line_item.quantity > 1
      @line_item.quantity -= 1
    end
    @line_item.save